### Top 10 country ratio versus the rest of the world

In [206]:
import pandas as pd

In [208]:
# assign the country csv file to a variable
path = ('country_clean.csv')

# read the csv file
countries_vs_world = pd.read_csv(path, index_col=0)
countries_vs_world

,Country,2020,2019,Area (km²),Growth Rate (%),World Ratio (%)
Rank,,,,,,
1,China,1442166775,1433783686,9706961,0.39,18.47
2,India,1387177258,1366417754,3287590,0.99,17.70
3,United States,332041150,329064917,9372610,0.59,4.25
4,Indonesia,275056196,270625568,1904569,1.07,3.51
5,Pakistan,223154088,216565318,881912,2.00,2.83
...,...,...,...,...,...,...
228,Montserrat,4992,4989,102,0.06,0.00
229,Falkland Islands,3480,3377,12173,3.05,0.00
230,Niue,1626,1615,260,0.68,0.00
231,Tokelau,1357,1340,12,1.27,0.00
232,Vatican City,801,799,1,0.25,0.00

In [210]:
# grab the top 10 countries
top_10 = countries_vs_world.head(10)
top_10

,Country,2020,2019,Area (km²),Growth Rate (%),World Ratio (%)
Rank,,,,,,
1,China,1442166775,1433783686,9706961,0.39,18.47
2,India,1387177258,1366417754,3287590,0.99,17.70
3,United States,332041150,329064917,9372610,0.59,4.25
4,Indonesia,275056196,270625568,1904569,1.07,3.51
5,Pakistan,223154088,216565318,881912,2.00,2.83
6,Brazil,213344896,211049527,8515767,0.72,2.73
7,Nigeria,208873242,200963599,923768,2.58,2.64
8,Bangladesh,165549495,163046161,147570,1.01,2.11
9,Russia,145960882,145872256,17098242,0.04,1.87
10,Mexico,129649385,127575529,1964375,1.06,1.65

In [211]:
# delete unecessary columns
del top_10['2019'], top_10['Area (km²)'], top_10['Growth Rate (%)']
top_10

            Country        2020  World Ratio (%)
Rank
1             China  1442166775            18.47
2             India  1387177258            17.70
3     United States   332041150             4.25
4         Indonesia   275056196             3.51
5          Pakistan   223154088             2.83
6            Brazil   213344896             2.73
7           Nigeria   208873242             2.64
8        Bangladesh   165549495             2.11
9            Russia   145960882             1.87
10           Mexico   129649385             1.65

In [212]:
# sum of the world ratio of the top 10 countries
print(top_10['World Ratio (%)'].sum(axis=0))

57.76

In [213]:
# grab the remaining countries
rest_of_the_world = countries_vs_world.tail(222)
rest_of_the_world

,Country,2020,2019,Area (km²),Growth Rate (%),World Ratio (%)
Rank,,,,,,
11,Japan,126275125,126860301,377930,-0.30,1.62
12,Ethiopia,116483634,112078730,1104300,2.57,1.47
13,Philippines,110360579,108116615,342353,1.35,1.41
14,Egypt,103358053,100388073,1002450,1.94,1.31
15,Vietnam,97793127,96462106,331212,0.91,1.25
...,...,...,...,...,...,...
228,Montserrat,4992,4989,102,0.06,0.00
229,Falkland Islands,3480,3377,12173,3.05,0.00
230,Niue,1626,1615,260,0.68,0.00
231,Tokelau,1357,1340,12,1.27,0.00
232,Vatican City,801,799,1,0.25,0.00

In [214]:
# delete unecessary columns
del rest_of_the_world['2019'], rest_of_the_world['Area (km²)'], rest_of_the_world['Growth Rate (%)']
rest_of_the_world

               Country       2020  World Ratio (%)
Rank
11               Japan  126275125             1.62
12            Ethiopia  116483634             1.47
13         Philippines  110360579             1.41
14               Egypt  103358053             1.31
15             Vietnam   97793127             1.25
...                ...        ...              ...
228         Montserrat       4992             0.00
229   Falkland Islands       3480             0.00
230               Niue       1626             0.00
231            Tokelau       1357             0.00
232       Vatican City        801             0.00

[222 rows x 3 columns]

In [215]:
# population of the rest of the world from rank 11
rest_of_the_world_sum = rest_of_the_world['2020'].sum(axis=0)
print(rest_of_the_world_sum)

3314375271

In [216]:
# rest of the world ratio from rank 11
rest_of_the_world_ratio = 100 - top_10['World Ratio (%)'].sum(axis=0)
print(rest_of_the_world_ratio)

42.24

In [217]:
# add a new row the the rest of the world data
new_row = {'Country':'Rest of the World', '2020':rest_of_the_world_sum, 'World Ratio (%)':rest_of_the_world_ratio}
population_ratio = top_10.append(new_row, ignore_index=True)

#append row to the dataframe
population_ratio

              Country        2020  World Ratio (%)
0               China  1442166775            18.47
1               India  1387177258            17.70
2       United States   332041150             4.25
3           Indonesia   275056196             3.51
4            Pakistan   223154088             2.83
5              Brazil   213344896             2.73
6             Nigeria   208873242             2.64
7          Bangladesh   165549495             2.11
8              Russia   145960882             1.87
9              Mexico   129649385             1.65
10  Rest of the World  3314375271            42.24

In [218]:
# set the Country as the index
population_ratio.set_index("Country", inplace = True)
population_ratio

                         2020  World Ratio (%)
Country
China              1442166775            18.47
India              1387177258            17.70
United States       332041150             4.25
Indonesia           275056196             3.51
Pakistan            223154088             2.83
Brazil              213344896             2.73
Nigeria             208873242             2.64
Bangladesh          165549495             2.11
Russia              145960882             1.87
Mexico              129649385             1.65
Rest of the World  3314375271            42.24

In [219]:
# export the population_ratio to a csv file
population_ratio.to_csv("population_ratio.csv")